In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns
from decouple import config
import decouple
config = decouple.AutoConfig('g:\PythonPractice\python practice.py\guvi\projects\Local Food Wastage Management System')

<>:7: SyntaxWarning: invalid escape sequence '\P'
<>:7: SyntaxWarning: invalid escape sequence '\P'
C:\Users\OWNER\AppData\Local\Temp\ipykernel_9344\3924297067.py:7: SyntaxWarning: invalid escape sequence '\P'
  config = decouple.AutoConfig('g:\PythonPractice\python practice.py\guvi\projects\Local Food Wastage Management System')

Data preprocessing

In [3]:
data_claims = pd.read_csv('data/claims_data.csv')
data_food_listings = pd.read_csv('data/food_listings_data.csv')
data_providers = pd.read_csv('data/providers_data.csv')
data_receivers = pd.read_csv('data/receivers_data.csv')

In [4]:
data_receivers.head()
data_receivers.info()
data_receivers.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Receiver_ID  1000 non-null   int64
 1   Name         1000 non-null   object
 2   Type         1000 non-null   object
 3   City         1000 non-null   object
 4   Contact      1000 non-null   object
dtypes: int64(1), object(4)
memory usage: 39.2+ KB

       Receiver_ID
count  1000.000000
mean    500.500000
std     288.819436
min       1.000000
25%     250.750000
50%     500.500000
75%     750.250000
max    1000.000000

In [5]:
data_providers.head()
data_providers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Provider_ID  1000 non-null   int64
 1   Name         1000 non-null   object
 2   Type         1000 non-null   object
 3   Address      1000 non-null   object
 4   City         1000 non-null   object
 5   Contact      1000 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.0+ KB

In [6]:
data_food_listings.head()
# data_food_listings['Food_Type'].value_counts()
data_food_listings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Food_ID        1000 non-null   int64
 1   Food_Name      1000 non-null   object
 2   Quantity       1000 non-null   int64
 3   Expiry_Date    1000 non-null   object
 4   Provider_ID    1000 non-null   int64
 5   Provider_Type  1000 non-null   object
 6   Location       1000 non-null   object
 7   Food_Type      1000 non-null   object
 8   Meal_Type      1000 non-null   object
dtypes: int64(3), object(6)
memory usage: 70.4+ KB

In [7]:
data_claims.head()
data_claims.info()
data_claims.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Claim_ID     1000 non-null   int64
 1   Food_ID      1000 non-null   int64
 2   Receiver_ID  1000 non-null   int64
 3   Status       1000 non-null   object
 4   Timestamp    1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

          Claim_ID      Food_ID  Receiver_ID
count  1000.000000  1000.000000  1000.000000
mean    500.500000   502.163000   492.437000
std     288.819436   292.462255   284.487869
min       1.000000     1.000000     1.000000
25%     250.750000   233.750000   256.000000
50%     500.500000   504.500000   480.500000
75%     750.250000   762.000000   742.250000
max    1000.000000   999.000000  1000.000000

Null and duplicate remove

In [8]:
data_claims.isnull().sum()    #None
data_claims.duplicated().sum()    #None

np.int64(0)

In [9]:
data_food_listings.isnull().sum()   #None
data_food_listings.duplicated().sum()   #None

np.int64(0)

In [10]:
data_providers.isnull().sum()   #None
data_providers.duplicated().sum()   #None

np.int64(0)

In [11]:
data_receivers.isnull().sum()   #None
data_receivers.duplicated().sum()   #None

np.int64(0)

Mysql connection

In [12]:
import MySQLdb

try:
    db = MySQLdb.connect(
        host=config('db_host'),
        user=config("db_user"),
        passwd=config('db_password'),
        port=int(config('db_port')),
        # database='food_wastage_management_system'
    )
    cursor = db.cursor()
    print("Connected to the database successfully!")
except MySQLdb.Error as e:
    print(f"Error connecting to database: {e}")

Connected to the database successfully!

create databases

In [13]:
cursor.execute("CREATE DATABASE IF NOT EXISTS food_wastage_management_system")
db.commit()

In [14]:
query_use_db = "USE food_wastage_management_system"
cursor.execute(query_use_db)

# Creating  Table

cursor.execute("""
    CREATE TABLE IF NOT EXISTS providers (
        Provider_ID INT PRIMARY KEY,
        Name VARCHAR(255),
        Type VARCHAR(100),
        Address TEXT,
        City VARCHAR(100),
        Contact VARCHAR(50)
    )
""")
cursor.execute("""
    CREATE TABLE IF NOT EXISTS receivers (
        Receiver_ID INT PRIMARY KEY,
        Name VARCHAR(255),
        Type VARCHAR(100),
        City VARCHAR(100),
        Contact VARCHAR(50)
    )
""")
cursor.execute("""
    CREATE TABLE IF NOT EXISTS food_listings (
        Food_ID INT PRIMARY KEY,
        Food_Name VARCHAR(255),
        Quantity INT,
        Expiry_Date DATE,       
        Provider_ID INT,
        Provider_Type VARCHAR(100),
        Location VARCHAR(255),
        Food_Type VARCHAR(100),
        Meal_Type VARCHAR(100),          
        FOREIGN KEY (Provider_ID) REFERENCES providers(Provider_ID)
    )
""")
cursor.execute("""
    CREATE TABLE IF NOT EXISTS claims (
        Claim_ID INT PRIMARY KEY,
        Food_ID INT,
        Receiver_ID INT,
        Status VARCHAR(50),
        Timestamp DATETIME,       
        FOREIGN KEY (Food_ID) REFERENCES food_listings(Food_ID),
        FOREIGN KEY (Receiver_ID) REFERENCES receivers(Receiver_ID)
    )
""")
db.commit()

In [15]:
# data_food_listings['Expiry_Date']
# data_providers['Provider_ID'].values

In [16]:
# data_claims['Timestamp']

In [17]:
data_food_listings['Expiry_Date'] = pd.to_datetime(data_food_listings['Expiry_Date'], format='%m/%d/%Y')
data_claims['Timestamp'] = pd.to_datetime(
    data_claims['Timestamp'], 
    format='%m/%d/%Y %H:%M'
)

In [18]:
#Insert data into tables
try:
    for _, row in data_providers.iterrows():
        cursor.execute("""
        INSERT INTO providers (Provider_ID, Name, Type, Address, City, Contact)
        VALUES (%s, %s, %s, %s, %s, %s)
    """, tuple(row))
    for _, row in data_receivers.iterrows():
        cursor.execute("""
        INSERT INTO receivers (Receiver_ID, Name, Type, City, Contact)
        VALUES (%s, %s, %s, %s, %s)
    """, tuple(row))
    for _, row in data_food_listings.iterrows():
        cursor.execute("""
        INSERT INTO food_listings (Food_ID, Food_Name, Quantity, Expiry_Date, Provider_ID, Provider_Type, Location, Food_Type, Meal_Type)
        VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)
    """, tuple(row))
    for _, row in data_claims.iterrows():
        cursor.execute("""
        INSERT INTO claims (Claim_ID, Food_ID, Receiver_ID, Status, Timestamp)
        VALUES (%s, %s, %s, %s, %s)
    """, tuple(row))      
    cursor.execute("COMMIT")

except MySQLdb.Error as e:
    print(f"Error inserting data: {e}")

Error inserting data: (1062, "Duplicate entry '1' for key 'providers.PRIMARY'")

If Lock wait timeout exceeded; try restarting transaction

In [19]:
cursor.execute('show processlist')
processes = cursor.fetchall()
# for process in processes:
#     print(process)

In [20]:
# sleeping_ids = [37]  # the ones from SHOW PROCESSLIST
# for pid in sleeping_ids:
#     cursor.execute(f"kill {pid}")

Questions to be Answered (SQL Queries & Analysis)

Food Providers & Receivers

1-How many food providers and receivers are there in each city?

In [21]:
query='select city,COUNT(*) as Provider_Count  from providers GROUP BY City order by Provider_Count desc;'
cursor.execute(query)
results = cursor.fetchall()
# print(results)
pd.DataFrame(results, columns=['City','Provider_Count'])

                         City  Provider_Count
0                   New Carol               3
1    South Christopherborough               3
2                  New Amanda               2
3            North Kevinhaven               2
4                   Lake Kyle               2
..                        ...             ...
958              Manningshire               1
959             East Rossside               1
960                Joshuastad               1
961             Stevenchester               1
962               Brendantown               1

[963 rows x 2 columns]

In [22]:
query='select city,COUNT(*) as receiver_Count  from receivers GROUP BY City order by receiver_Count desc;'
cursor.execute(query)
results = cursor.fetchall()
# print(results)
pd.DataFrame(results, columns=['City','receivers_Count'])

                City  receivers_Count
0    New Christopher                3
1       Spencermouth                2
2       Moorechester                2
3          Lake Mary                2
4         Smithshire                2
..               ...              ...
961      Lanechester                1
962       New Steven                1
963     South Sandra                1
964     Lake Jeffery                1
965    Shelbychester                1

[966 rows x 2 columns]

Which type of food provider (restaurant, grocery store, etc.) contributes the most food?

In [23]:
data_food_listings.head(2)

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,2025-03-17,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,2025-03-24,791,Grocery Store,West James,Non-Vegetarian,Dinner

In [24]:
query='select Provider_Type	,sum(Quantity)  from food_listings group by Provider_Type ;'
cursor.execute(query)
results = cursor.fetchall()
pd.DataFrame(results, columns=['Provider_Type','Total_Quantity'])

      Provider_Type Total_Quantity
0     Grocery Store           6059
1  Catering Service           6116
2        Restaurant           6923
3       Supermarket           6696

What is the contact information of food providers in a specific city?

In [25]:
data_providers.head(2)

,Provider_ID,Name,Type,Address,City,Contact
0,1,Gonzales-Cochran,Supermarket,"74347 Christopher Extensions\nAndreamouth, OK ...",New Jessica,+1-600-220-0480
1,2,"Nielsen, Johnson and Fuller",Grocery Store,"91228 Hanson Stream\nWelchtown, OR 27136",East Sheena,+1-925-283-8901x6297

In [26]:
# data_providers['City'].value_counts()
query="select Name ,Contact, address from providers where city='South Christopherborough';"
cursor.execute(query)
results=cursor.fetchall()
pd.DataFrame(results)

,0,1,2
0,"Harris, Perez and Willis",581-281-6112,"549 Moody Road Suite 873\nJacobshire, VT 80966"
1,Torres-Dunlap,057.342.1300x473,Unit 1623 Box 5952\nDPO AA 55518
2,Brown and Sons,(352)481-4738,"725 Garner Locks\nAndrewchester, MI 49979"

Which receivers have claimed the most food

In [27]:
# data_claims['Receiver_ID'].value_counts()
data_claims.head(2)

   Claim_ID  Food_ID  Receiver_ID     Status           Timestamp
0         1      164          908    Pending 2025-03-05 05:26:00
1         2      353          391  Cancelled 2025-03-11 10:24:00

In [28]:
data_food_listings.head(2)
# data_food_listings['Food_Type'].value_counts()

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,2025-03-17,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,2025-03-24,791,Grocery Store,West James,Non-Vegetarian,Dinner

In [29]:
query = """
SELECT r.Receiver_ID, r.Name, COUNT(c.Claim_ID) AS Claim_Count
FROM claims c
JOIN receivers r ON c.Receiver_ID = r.Receiver_ID
GROUP BY r.Receiver_ID, r.Name
ORDER BY Claim_Count DESC
LIMIT 5;
"""
cursor.execute(query)
results = cursor.fetchall()
import pandas as pd
df = pd.DataFrame(results, columns=["Receiver_ID", "Name", "Claim_Count"])
print(df)

   Receiver_ID               Name  Claim_Count
0          800     Anthony Garcia            5
1          276       Scott Hunter            5
2          371  William Frederick            5
3          742       Matthew Webb            5
4          301   Kristina Simpson            4

What is the total quantity of food available from all providers?

In [30]:
data_food_listings.head(2)

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,2025-03-17,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,2025-03-24,791,Grocery Store,West James,Non-Vegetarian,Dinner

In [31]:
query='select sum(Quantity) from food_listings;'
cursor.execute(query)
results = cursor.fetchall()
pd.DataFrame(results,columns=['Total_Food_Quantity'])
# print("Total Food Quantity Available:",results[0][0])

  Total_Food_Quantity
0               25794

Which city has the highest number of food listings?

In [32]:
query = """
SELECT Location AS City, COUNT(*) AS FoodListing_Count
FROM food_listings
GROUP BY Location
ORDER BY FoodListing_Count DESC
LIMIT 1;
"""
cursor.execute(query)
# result = cursor.fetchone()
# print(f"City with the highest number of food listings: {result[0]}")
# print(f"Number of food listings: {result[1]}")
results = cursor.fetchall()
pd.DataFrame(results, columns=['City','FoodListing_Count'])

        City  FoodListing_Count
0  New Carol                  6

What are the most commonly available food types?

In [33]:
query="select Food_Type, count(*) as Most_Avilable from  food_listings group by Food_Type  limit 1"
cursor.execute(query)
results = cursor.fetchall()
pd.DataFrame(results, columns=['Food_Type','Most_Avilable'])

        Food_Type  Most_Avilable
0  Non-Vegetarian            330

. How many food claims have been made for each food item?

In [34]:
data_food_listings.head(2)

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,2025-03-17,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,2025-03-24,791,Grocery Store,West James,Non-Vegetarian,Dinner

In [35]:
data_claims.head(2)

   Claim_ID  Food_ID  Receiver_ID     Status           Timestamp
0         1      164          908    Pending 2025-03-05 05:26:00
1         2      353          391  Cancelled 2025-03-11 10:24:00

In [36]:
query="""
select f.Food_Name, count(c.food_id)   from claims as c join food_listings as f
on c.Food_ID=f.Food_ID
group by f.Food_Name
order by count(c.food_id) desc

"""
cursor.execute(query)
results = cursor.fetchall()
pd.DataFrame(results, columns=['Food_Name','Claim_Count'])

    Food_Name  Claim_Count
0        Rice          122
1        Soup          114
2       Dairy          110
3        Fish          108
4       Salad          106
5     Chicken          102
6       Bread           94
7       Pasta           87
8  Vegetables           86
9      Fruits           71

Which provider has had the highest number of successful food claims?

In [37]:
data_food_listings.head(2)

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,2025-03-17,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,2025-03-24,791,Grocery Store,West James,Non-Vegetarian,Dinner

In [38]:
data_claims.head(2)

   Claim_ID  Food_ID  Receiver_ID     Status           Timestamp
0         1      164          908    Pending 2025-03-05 05:26:00
1         2      353          391  Cancelled 2025-03-11 10:24:00

In [39]:
query='''
select f.Provider_ID ,count(c.Claim_ID) from claims c join food_listings f
on c.Food_ID=f.Food_ID
group by f.Provider_ID
limit 1
'''
cursor.execute(query)
results = cursor.fetchall()
pd.DataFrame(results, columns=['Provider_ID','Total_Claims'])

   Provider_ID  Total_Claims
0            1             3

. What percentage of food claims are completed vs. pending vs. canceled?

In [40]:
data_claims.head(2)

   Claim_ID  Food_ID  Receiver_ID     Status           Timestamp
0         1      164          908    Pending 2025-03-05 05:26:00
1         2      353          391  Cancelled 2025-03-11 10:24:00

In [41]:
query="select Status, count(*) from claims group by Status "
cursor.execute(query)
results = cursor.fetchall()
df=pd.DataFrame(results, columns=['Status','Count'])
df['percentage']= (df['Count']/df['Count'].sum())*100
df

      Status  Count  percentage
0    Pending    325        32.5
1  Cancelled    336        33.6
2  Completed    339        33.9

       11. What is the average quantity of food claimed per receiver?

In [42]:
data_food_listings.head(1)

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,2025-03-17,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast

In [43]:
data_claims.head(1)

   Claim_ID  Food_ID  Receiver_ID   Status           Timestamp
0         1      164          908  Pending 2025-03-05 05:26:00

In [44]:
query=" select c.Receiver_ID, avg(Quantity) from claims c join food_listings f on c.food_id=f.food_id group by  c.Receiver_ID "
cursor.execute(query)
results = cursor.fetchall()
pd.DataFrame(results, columns=['Receiver_ID','Avg_Quantity'])

     Receiver_ID Avg_Quantity
0            908      25.6667
1            391      12.0000
2            492      37.0000
3            933      24.5000
4            229      14.0000
..           ...          ...
619          943      23.0000
620          984      26.0000
621          211      28.0000
622          746       2.0000
623          967      19.0000

[624 rows x 2 columns]

       12. Which meal type (breakfast, lunch, dinner, snacks) is claimed the most?

In [45]:
query="select f.Meal_Type, count(*) from claims c join food_listings f on c.food_id=f.food_id group by  f.Meal_Type"
cursor.execute(query)
results = cursor.fetchall()
pd.DataFrame(results, columns=['Meal_Type','Count'])

   Meal_Type  Count
0  Breakfast    278
1     Snacks    240
2     Dinner    232
3      Lunch    250

What is the total quantity of food donated by each provider?

In [46]:
query="select f.Provider_ID, sum(f.Quantity) from claims c join food_listings f on c.food_id=f.food_id group by  f.Provider_ID	order by sum(f.Quantity) desc	"
cursor.execute(query)
results = cursor.fetchall()
pd.DataFrame(results, columns=['Provider_ID','Total_Quantity'])

     Provider_ID Total_Quantity
0            752            348
1            315            334
2            384            299
3            709            228
4            850            217
..           ...            ...
467          762              2
468          186              2
469          876              2
470          184              1
471          849              1

[472 rows x 2 columns]

Streamlit app

In [81]:
%%writefile food_wastage_analysis.py
import streamlit as st
import pandas as pd
from decouple import config
import MySQLdb
from MySQLdb.cursors import DictCursor

# -----------------------------
# DATABASE CONNECTION
# -----------------------------
def get_connection():
    try:
        conn = MySQLdb.connect(
            host=config('db_host'),
            user=config('db_user'),
            passwd=config('db_password'),
            port=int(config('db_port')),
            database='food_wastage_management_system',
            cursorclass=DictCursor
        )
        conn.autocommit(True)
        return conn
    except MySQLdb.Error as err:
        st.error(f"Database Connection Error: {err}")
        return None


# -----------------------------
# PAGE CONFIG & STYLES
# -----------------------------
st.set_page_config(
    page_title="Local Food Wastage Management System",
    layout="wide",
    page_icon="🍲"
)

# Inject custom CSS for modern look
st.markdown("""
    <style>
        /* Global background */
        [data-testid="stAppViewContainer"] {
            background: linear-gradient(120deg, #f8f9fa 0%, #e3f2fd 100%);
        }
        [data-testid="stSidebar"] {
            background-color: #0d47a1;
            color: white;
        }
        [data-testid="stSidebar"] * {
            color: white !important;
        }
        .main-title {
            font-size: 40px;
            color: #0d47a1;
            font-weight: 700;
            text-align: center;
            padding: 10px;
        }
        .section-header {
            font-size: 22px;
            color: #1565c0;
            font-weight: 600;
            margin-top: 25px;
        }
        .metric-card {
            background-color: #ffffffcc;
            padding: 20px;
            border-radius: 15px;
            text-align: center;
            box-shadow: 0 4px 10px rgba(0,0,0,0.1);
        }
        .stDataFrame {
            border-radius: 10px;
        }
    </style>
""", unsafe_allow_html=True)

# -----------------------------
# HEADER
# -----------------------------
st.markdown('<div class="main-title">🍲 Local Food Wastage Management System</div>', unsafe_allow_html=True)
st.markdown("<p style='text-align:center;'>Connecting surplus food providers with receivers using Streamlit + MySQL</p>", unsafe_allow_html=True)

menu =  ["Dashboard", "CRUD Operations", "SQL Analysis", "Query Explorer", "About"]

choice = st.sidebar.selectbox("📂 Navigation", menu)

conn = get_connection()
if conn:
    cursor = conn.cursor()

    # -------- DASHBOARD --------
    if choice == "Dashboard":
        st.markdown('<div class="section-header">📊 Food Distribution Insights</div>', unsafe_allow_html=True)

        # --- FILTERS SECTION ---
        with st.expander("🔍 Filter Options", expanded=True):
            col1, col2, col3, col4 = st.columns(4)
            try:
                cursor.execute("SELECT DISTINCT Location FROM food_listings;")
                cities = [row['Location'] for row in cursor.fetchall()]

                cursor.execute("SELECT DISTINCT Provider_ID FROM food_listings;")
                providers = [str(row['Provider_ID']) for row in cursor.fetchall()]

                cursor.execute("SELECT DISTINCT Food_Type FROM food_listings;")
                food_types = [row['Food_Type'] for row in cursor.fetchall()]

                cursor.execute("SELECT DISTINCT Meal_Type FROM food_listings;")
                meal_types = [row['Meal_Type'] for row in cursor.fetchall()]
            except MySQLdb.Error:
                cities, providers, food_types, meal_types = [], [], [], []

            selected_city = col1.selectbox("City", ["All"] + cities)
            selected_provider = col2.selectbox("Provider ID", ["All"] + providers)
            selected_food_type = col3.selectbox("Food Type", ["All"] + food_types)
            selected_meal_type = col4.selectbox("Meal Type", ["All"] + meal_types)

        # --- FILTERED FOOD LISTINGS ---
        query = "SELECT * FROM food_listings WHERE 1=1"
        params = []

        if selected_city != "All":
            query += " AND Location = %s"
            params.append(selected_city)
        if selected_provider != "All":
            query += " AND Provider_ID = %s"
            params.append(selected_provider)
        if selected_food_type != "All":
            query += " AND Food_Type = %s"
            params.append(selected_food_type)
        if selected_meal_type != "All":
            query += " AND Meal_Type = %s"
            params.append(selected_meal_type)

        cursor.execute(query, params)
        food_data = pd.DataFrame(cursor.fetchall())

        st.markdown('<div class="section-header">🍱 Filtered Food Listings</div>', unsafe_allow_html=True)
        if not food_data.empty:
            st.dataframe(food_data, use_container_width=True)
        else:
            st.warning("No records found for the selected filters.")

        # --- PROVIDER CONTACT DETAILS ---
        st.markdown('<div class="section-header">📞 Provider Contact Details</div>', unsafe_allow_html=True)
        try:
            provider_query = """
                SELECT p.Provider_ID, p.Name AS Provider_Name, p.Type, p.City, p.Contact
                FROM providers p
                WHERE p.Provider_ID IN (
                    SELECT DISTINCT Provider_ID FROM food_listings
                )
                ORDER BY p.City;
            """
            cursor.execute(provider_query)
            provider_data = pd.DataFrame(cursor.fetchall())
            if not provider_data.empty:
                st.dataframe(provider_data, use_container_width=True)
            else:
                st.info("No provider contact data found.")
        except MySQLdb.Error as e:
            st.error(f"Error fetching provider contacts: {e}")

        # --- QUICK METRICS ---
        st.markdown('<div class="section-header">📈 Quick Statistics</div>', unsafe_allow_html=True)
        colm1, colm2, colm3 = st.columns(3)
        cursor.execute("SELECT COUNT(*) AS total FROM providers;")
        providers_count = cursor.fetchone()['total']
        cursor.execute("SELECT COUNT(*) AS total FROM receivers;")
        receivers_count = cursor.fetchone()['total']
        cursor.execute("SELECT SUM(Quantity) AS qty FROM food_listings;")
        total_food = cursor.fetchone()['qty']

        colm1.metric("Total Providers", providers_count)
        colm2.metric("Total Receivers", receivers_count)
        colm3.metric("Total Food Quantity", total_food if total_food else 0)

        # --- ADVANCED INSIGHTS ---
        st.markdown('<div class="section-header">📊 Analytical Reports</div>', unsafe_allow_html=True)
        insights = {
            "Providers per City": "SELECT City, COUNT(*) AS Providers FROM providers GROUP BY City;",
            "Top Provider Types": "SELECT Type, COUNT(*) AS Total FROM providers GROUP BY Type ORDER BY Total DESC;",
            "Claims by Status": "SELECT Status, COUNT(*) AS Count FROM claims GROUP BY Status;"
        }

        for name, q in insights.items():
            st.write(f"#### {name}")
            cursor.execute(q)
            df = pd.DataFrame(cursor.fetchall())
            st.dataframe(df, use_container_width=True)
            if len(df.columns) == 2:
                st.bar_chart(df.set_index(df.columns[0]))

    # -------- CRUD OPERATIONS --------
    elif choice == "CRUD Operations":
        st.markdown('<div class="section-header">🛠 Manage Food Listings</div>', unsafe_allow_html=True)
        action = st.selectbox("Select Action", ["Add", "View", "Update", "Delete"])

        if action == "Add":
            with st.form("add_form"):
                food_name = st.text_input("Food Name")
                qty = st.number_input("Quantity", min_value=1)
                expiry = st.date_input("Expiry Date")
                provider_id = st.number_input("Provider ID", min_value=1)
                location = st.text_input("Location")
                food_type = st.selectbox("Food Type", ["Vegetarian", "Non-Vegetarian", "Vegan"])
                meal_type = st.selectbox("Meal Type", ["Breakfast", "Lunch", "Dinner", "Snacks"])
                submitted = st.form_submit_button("Add Record")
                if submitted:
                    cursor.execute("""
                        INSERT INTO food_listings 
                        (Food_Name, Quantity, Expiry_Date, Provider_ID, Location, Food_Type, Meal_Type)
                        VALUES (%s, %s, %s, %s, %s, %s, %s);
                    """, (food_name, qty, expiry, provider_id, location, food_type, meal_type))
                    conn.commit()
                    st.success("✅ Record added successfully!")

        elif action == "View":
            cursor.execute("SELECT * FROM food_listings LIMIT 20;")
            st.dataframe(pd.DataFrame(cursor.fetchall()), use_container_width=True)

        elif action == "Update":
            food_id = st.number_input("Food ID to Update", min_value=1)
            new_qty = st.number_input("New Quantity", min_value=1)
            if st.button("Update Quantity"):
                cursor.execute("UPDATE food_listings SET Quantity=%s WHERE Food_ID=%s;", (new_qty, food_id))
                if cursor.rowcount == 0:
                    st.warning("⚠️ No record found with that Food_ID.")
                else:
                    conn.commit()
                    st.success("✅ Quantity updated successfully!")

        elif action == "Delete":
            food_id = st.number_input("Food ID to Delete", min_value=1)
            if st.button("Delete Record"):
                cursor.execute("DELETE FROM food_listings WHERE Food_ID=%s;", (food_id,))
                conn.commit()
                st.warning("🗑️ Record deleted successfully.")

    # -------- SQL ANALYSIS (15 Queries) --------
    elif choice == "SQL Analysis":
        st.markdown('<div class="section-header">🧮 SQL Analysis — 15 Key Insights</div>', unsafe_allow_html=True)
        st.write("Below are the results of the 15 SQL queries defined in the project requirements:")

        sql_queries = {
            # 1. Providers per City
            "1️⃣ Providers per City": """
                SELECT City, COUNT(*) AS Total_Providers 
                FROM providers 
                GROUP BY City;
            """,

            # 2. Receivers per City
            "2️⃣ Receivers per City": """
                SELECT City, COUNT(*) AS Total_Receivers 
                FROM receivers 
                GROUP BY City;
            """,

            # 3. Top Provider Types
            "3️⃣ Top Provider Types": """
                SELECT Type, COUNT(*) AS Total 
                FROM providers 
                GROUP BY Type 
                ORDER BY Total DESC;
            """,

            # 4. Contact Info of Providers by City
            "4️⃣ Provider Contact Info (Sample City: Delhi)": """
                SELECT Name, Contact, City 
                FROM providers 
                WHERE City = 'Delhi';
            """,

            # 5. Top Receivers by Food Claims
            "5️⃣ Top Receivers by Food Claims": """
                SELECT r.Name, COUNT(c.Claim_ID) AS Total_Claims
                FROM receivers r
                JOIN claims c ON r.Receiver_ID = c.Receiver_ID
                GROUP BY r.Name
                ORDER BY Total_Claims DESC;
            """,

            # 6. Total Food Quantity Available
            "6️⃣ Total Food Quantity Available": """
                SELECT SUM(Quantity) AS Total_Quantity 
                FROM food_listings;
            """,

            # 7. Cities with Highest Food Listings
            "7️⃣ Cities with Highest Food Listings": """
                SELECT Location AS City, COUNT(*) AS Listings
                FROM food_listings
                GROUP BY Location
                ORDER BY Listings DESC;
            """,

            # 8. Most Common Food Types
            "8️⃣ Most Common Food Types": """
                SELECT Food_Type, COUNT(*) AS Count 
                FROM food_listings 
                GROUP BY Food_Type 
                ORDER BY Count DESC;
            """,

            # 9. Total Claims per Food Item
            "9️⃣ Total Claims per Food Item": """
                SELECT f.Food_Name, COUNT(c.Claim_ID) AS Total_Claims
                FROM food_listings f
                LEFT JOIN claims c ON f.Food_ID = c.Food_ID
                GROUP BY f.Food_Name;
            """,

            # 10. Top Providers with Most Successful Claims
            "🔟 Top Providers with Most Successful Claims": """
                SELECT p.Name AS Provider, COUNT(c.Claim_ID) AS Successful_Claims
                FROM providers p
                JOIN food_listings f ON p.Provider_ID = f.Provider_ID
                JOIN claims c ON f.Food_ID = c.Food_ID
                WHERE c.Status = 'Completed'
                GROUP BY p.Name
                ORDER BY Successful_Claims DESC;
            """,

            # 11. Claim Status Percentage
            "1️⃣1️⃣ Claim Status Percentage": """
                SELECT Status, 
                       ROUND(COUNT(*) * 100 / (SELECT COUNT(*) FROM claims), 2) AS Percentage
                FROM claims 
                GROUP BY Status;
            """,

            # 12. Average Quantity Claimed per Receiver
            "1️⃣2️⃣ Average Quantity Claimed per Receiver": """
                SELECT r.Name, ROUND(AVG(f.Quantity), 2) AS Avg_Quantity
                FROM receivers r
                JOIN claims c ON r.Receiver_ID = c.Receiver_ID
                JOIN food_listings f ON c.Food_ID = f.Food_ID
                GROUP BY r.Name;
            """,

            # 13. Most Claimed Meal Type
            "1️⃣3️⃣ Most Claimed Meal Type": """
                SELECT f.Meal_Type, COUNT(c.Claim_ID) AS Total_Claims
                FROM food_listings f
                JOIN claims c ON f.Food_ID = c.Food_ID
                GROUP BY f.Meal_Type
                ORDER BY Total_Claims DESC;
            """,

            # 14. Total Food Donated by Provider
            "1️⃣4️⃣ Total Food Donated by Provider": """
                SELECT p.Name, SUM(f.Quantity) AS Total_Donated
                FROM providers p
                JOIN food_listings f ON p.Provider_ID = f.Provider_ID
                GROUP BY p.Name;
            """,

            # 15. Food Wastage Trend by Expiry
            "1️⃣5️⃣ Food Wastage Trend (Expired Items)": """
                SELECT COUNT(*) AS Expired_Foods
                FROM food_listings
                WHERE Expiry_Date < CURDATE();
            """
        }

        for title, q in sql_queries.items():
            st.markdown(f"#### {title}")
            try:
                cursor.execute(q)
                result = pd.DataFrame(cursor.fetchall())
                if not result.empty:
                    st.dataframe(result, use_container_width=True)
                    # show chart if suitable
                    if len(result.columns) == 2:
                        st.bar_chart(result.set_index(result.columns[0]))
                else:
                    st.info("No data returned for this query.")
            except MySQLdb.Error as e:
                st.error(f"Error executing {title}: {e}")
            st.markdown("---")





    # -------- QUERY EXPLORER --------
    elif choice == "Query Explorer":
        st.markdown('<div class="section-header">🔍 Explore SQL Queries</div>', unsafe_allow_html=True)
        query = st.text_area("Enter SQL Query")
        if st.button("Run Query"):
            try:
                cursor.execute(query)
                st.dataframe(pd.DataFrame(cursor.fetchall()), use_container_width=True)
            except MySQLdb.Error as e:
                st.error(f"SQL Error: {e}")

    elif choice == "About":
        st.info("""
        **Developed by:** Nirmal Kumar Bhagatkar  
        **Technology Stack:** Streamlit, Python, MySQL  
        **Objective:** Connecting surplus food providers with receivers and NGOs to reduce food wastage.  
        """)

    cursor.close()
    conn.close()
else:
    st.error("❌ Database connection failed.")

Overwriting food_wastage_analysis.py

In [48]:
# streamlit run food_wastage_analysis.py    # copy and paste in terminal to run the streamlit app

In [77]:
data_food_listings.head(1)

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,2025-03-17,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast